7767517
355 400
Input                    in0                      0 1 in0
Convolution              conv_131                 1 1 in0 1 0=40 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1080
Swish                    silu_53                  1 1 1 2
ConvolutionDepthWise     convdw_264               1 1 2 3 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=360 7=40
Swish                    silu_54                  1 1 3 4
Split                    splitncnn_0              1 2 4 5 6
Pooling                  gap_0                    1 1 6 7 0=1 4=1
Convolution              conv_132                 1 1 7 8 0=10 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=400
Swish                    silu_55                  1 1 8 9
Convolution              convsigmoid_0            1 1 9 10 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=400 9=4
Reshape                  reshape_236              1 1 10 11 0=1 1=1 2=-1
BinaryOp                 mul_0                    2 1 11 5 12 0=2
Convolution              conv_134                 1 1 12 13 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=960
Split                    splitncnn_1              1 2 13 14 15
ConvolutionDepthWise     convdw_265               1 1 15 16 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24
Swish                    silu_56                  1 1 16 17
Split                    splitncnn_2              1 2 17 18 19
Pooling                  gap_1                    1 1 19 20 0=1 4=1
Convolution              conv_135                 1 1 20 21 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144
Swish                    silu_57                  1 1 21 22
Convolution              convsigmoid_1            1 1 22 23 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144 9=4
Reshape                  reshape_237              1 1 23 24 0=1 1=1 2=-1
BinaryOp                 mul_1                    2 1 24 18 25 0=2
Convolution              conv_137                 1 1 25 26 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
BinaryOp                 add_2                    2 1 26 14 27 0=0
Convolution              conv_138                 1 1 27 28 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
Swish                    silu_58                  1 1 28 29
ConvolutionDepthWise     convdw_266               1 1 29 30 0=144 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1296 7=144
Swish                    silu_59                  1 1 30 31
Split                    splitncnn_3              1 2 31 32 33
Pooling                  gap_2                    1 1 33 34 0=1 4=1
Convolution              conv_139                 1 1 34 35 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=864
Swish                    silu_60                  1 1 35 36
Convolution              convsigmoid_2            1 1 36 37 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=864 9=4
Reshape                  reshape_238              1 1 37 38 0=1 1=1 2=-1
BinaryOp                 mul_3                    2 1 38 32 39 0=2
Convolution              conv_141                 1 1 39 40 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Split                    splitncnn_4              1 2 40 41 42
Convolution              conv_142                 1 1 42 43 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_61                  1 1 43 44
ConvolutionDepthWise     convdw_267               1 1 44 45 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192
Swish                    silu_62                  1 1 45 46
Split                    splitncnn_5              1 2 46 47 48
Pooling                  gap_3                    1 1 48 49 0=1 4=1
Convolution              conv_143                 1 1 49 50 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_63                  1 1 50 51
Convolution              convsigmoid_3            1 1 51 52 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536 9=4
Reshape                  reshape_239              1 1 52 53 0=1 1=1 2=-1
BinaryOp                 mul_4                    2 1 53 47 54 0=2
Convolution              conv_145                 1 1 54 55 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
BinaryOp                 add_5                    2 1 55 41 56 0=0
Split                    splitncnn_6              1 2 56 57 58
Convolution              conv_146                 1 1 58 59 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_64                  1 1 59 60
ConvolutionDepthWise     convdw_268               1 1 60 61 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192
Swish                    silu_65                  1 1 61 62
Split                    splitncnn_7              1 2 62 63 64
Pooling                  gap_4                    1 1 64 65 0=1 4=1
Convolution              conv_147                 1 1 65 66 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_66                  1 1 66 67
Convolution              convsigmoid_4            1 1 67 68 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536 9=4
Reshape                  reshape_240              1 1 68 69 0=1 1=1 2=-1
BinaryOp                 mul_6                    2 1 69 63 70 0=2
Convolution              conv_149                 1 1 70 71 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
BinaryOp                 add_7                    2 1 71 57 72 0=0
Convolution              conv_150                 1 1 72 73 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_67                  1 1 73 74
ConvolutionDepthWise     convdw_269               1 1 74 75 0=192 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=4800 7=192
Swish                    silu_68                  1 1 75 76
Split                    splitncnn_8              1 2 76 77 78
Pooling                  gap_5                    1 1 78 79 0=1 4=1
Convolution              conv_151                 1 1 79 80 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_69                  1 1 80 81
Convolution              convsigmoid_5            1 1 81 82 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536 9=4
Reshape                  reshape_241              1 1 82 83 0=1 1=1 2=-1
BinaryOp                 mul_8                    2 1 83 77 84 0=2
Convolution              conv_153                 1 1 84 85 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Split                    splitncnn_9              1 2 85 86 87
Convolution              conv_154                 1 1 87 88 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
Swish                    silu_70                  1 1 88 89
ConvolutionDepthWise     convdw_270               1 1 89 90 0=288 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=7200 7=288
Swish                    silu_71                  1 1 90 91
Split                    splitncnn_10             1 2 91 92 93
Pooling                  gap_6                    1 1 93 94 0=1 4=1
Convolution              conv_155                 1 1 94 95 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
Swish                    silu_72                  1 1 95 96
Convolution              convsigmoid_6            1 1 96 97 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456 9=4
Reshape                  reshape_242              1 1 97 98 0=1 1=1 2=-1
BinaryOp                 mul_9                    2 1 98 92 99 0=2
Convolution              conv_157                 1 1 99 100 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
BinaryOp                 add_10                   2 1 100 86 101 0=0
Split                    splitncnn_11             1 2 101 102 103
Convolution              conv_158                 1 1 103 104 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
Swish                    silu_73                  1 1 104 105
ConvolutionDepthWise     convdw_271               1 1 105 106 0=288 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=7200 7=288
Swish                    silu_74                  1 1 106 107
Split                    splitncnn_12             1 2 107 108 109
Pooling                  gap_7                    1 1 109 110 0=1 4=1
Convolution              conv_159                 1 1 110 111 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
Swish                    silu_75                  1 1 111 112
Convolution              convsigmoid_7            1 1 112 113 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456 9=4
Reshape                  reshape_243              1 1 113 114 0=1 1=1 2=-1
BinaryOp                 mul_11                   2 1 114 108 115 0=2
Convolution              conv_161                 1 1 115 116 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
BinaryOp                 add_12                   2 1 116 102 117 0=0
Convolution              conv_162                 1 1 117 118 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
Swish                    silu_76                  1 1 118 119
ConvolutionDepthWise     convdw_272               1 1 119 120 0=288 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2592 7=288
Swish                    silu_77                  1 1 120 121
Split                    splitncnn_13             1 2 121 122 123
Pooling                  gap_8                    1 1 123 124 0=1 4=1
Convolution              conv_163                 1 1 124 125 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
Swish                    silu_78                  1 1 125 126
Convolution              convsigmoid_8            1 1 126 127 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456 9=4
Reshape                  reshape_244              1 1 127 128 0=1 1=1 2=-1
BinaryOp                 mul_13                   2 1 128 122 129 0=2
Convolution              conv_165                 1 1 129 130 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27648
Split                    splitncnn_14             1 2 130 131 132
Convolution              conv_166                 1 1 132 133 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
Swish                    silu_79                  1 1 133 134
ConvolutionDepthWise     convdw_273               1 1 134 135 0=576 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 7=576
Swish                    silu_80                  1 1 135 136
Split                    splitncnn_15             1 2 136 137 138
Pooling                  gap_9                    1 1 138 139 0=1 4=1
Convolution              conv_167                 1 1 139 140 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
Swish                    silu_81                  1 1 140 141
Convolution              convsigmoid_9            1 1 141 142 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824 9=4
Reshape                  reshape_245              1 1 142 143 0=1 1=1 2=-1
BinaryOp                 mul_14                   2 1 143 137 144 0=2
Convolution              conv_169                 1 1 144 145 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
BinaryOp                 add_15                   2 1 145 131 146 0=0
Split                    splitncnn_16             1 2 146 147 148
Convolution              conv_170                 1 1 148 149 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
Swish                    silu_82                  1 1 149 150
ConvolutionDepthWise     convdw_274               1 1 150 151 0=576 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 7=576
Swish                    silu_83                  1 1 151 152
Split                    splitncnn_17             1 2 152 153 154
Pooling                  gap_10                   1 1 154 155 0=1 4=1
Convolution              conv_171                 1 1 155 156 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
Swish                    silu_84                  1 1 156 157
Convolution              convsigmoid_10           1 1 157 158 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824 9=4
Reshape                  reshape_246              1 1 158 159 0=1 1=1 2=-1
BinaryOp                 mul_16                   2 1 159 153 160 0=2
Convolution              conv_173                 1 1 160 161 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
BinaryOp                 add_17                   2 1 161 147 162 0=0
Split                    splitncnn_18             1 2 162 163 164
Convolution              conv_174                 1 1 164 165 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
Swish                    silu_85                  1 1 165 166
ConvolutionDepthWise     convdw_275               1 1 166 167 0=576 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 7=576
Swish                    silu_86                  1 1 167 168
Split                    splitncnn_19             1 2 168 169 170
Pooling                  gap_11                   1 1 170 171 0=1 4=1
Convolution              conv_175                 1 1 171 172 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
Swish                    silu_87                  1 1 172 173
Convolution              convsigmoid_11           1 1 173 174 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824 9=4
Reshape                  reshape_247              1 1 174 175 0=1 1=1 2=-1
BinaryOp                 mul_18                   2 1 175 169 176 0=2
Convolution              conv_177                 1 1 176 177 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
BinaryOp                 add_19                   2 1 177 163 178 0=0
Split                    splitncnn_20             1 2 178 179 180
Convolution              conv_178                 1 1 180 181 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
Swish                    silu_88                  1 1 181 182
ConvolutionDepthWise     convdw_276               1 1 182 183 0=576 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 7=576
Swish                    silu_89                  1 1 183 184
Split                    splitncnn_21             1 2 184 185 186
Pooling                  gap_12                   1 1 186 187 0=1 4=1
Convolution              conv_179                 1 1 187 188 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
Swish                    silu_90                  1 1 188 189
Convolution              convsigmoid_12           1 1 189 190 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824 9=4
Reshape                  reshape_248              1 1 190 191 0=1 1=1 2=-1
BinaryOp                 mul_20                   2 1 191 185 192 0=2
Convolution              conv_181                 1 1 192 193 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
BinaryOp                 add_21                   2 1 193 179 194 0=0
Convolution              conv_182                 1 1 194 195 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
Swish                    silu_91                  1 1 195 196
ConvolutionDepthWise     convdw_277               1 1 196 197 0=576 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=14400 7=576
Swish                    silu_92                  1 1 197 198
Split                    splitncnn_22             1 2 198 199 200
Pooling                  gap_13                   1 1 200 201 0=1 4=1
Convolution              conv_183                 1 1 201 202 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
Swish                    silu_93                  1 1 202 203
Convolution              convsigmoid_13           1 1 203 204 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824 9=4
Reshape                  reshape_249              1 1 204 205 0=1 1=1 2=-1
BinaryOp                 mul_22                   2 1 205 199 206 0=2
Convolution              conv_185                 1 1 206 207 0=136 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=78336
Split                    splitncnn_23             1 2 207 208 209
Convolution              conv_186                 1 1 209 210 0=816 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110976
Swish                    silu_94                  1 1 210 211
ConvolutionDepthWise     convdw_278               1 1 211 212 0=816 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=20400 7=816
Swish                    silu_95                  1 1 212 213
Split                    splitncnn_24             1 2 213 214 215
Pooling                  gap_14                   1 1 215 216 0=1 4=1
Convolution              conv_187                 1 1 216 217 0=34 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27744
Swish                    silu_96                  1 1 217 218
Convolution              convsigmoid_14           1 1 218 219 0=816 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27744 9=4
Reshape                  reshape_250              1 1 219 220 0=1 1=1 2=-1
BinaryOp                 mul_23                   2 1 220 214 221 0=2
Convolution              conv_189                 1 1 221 222 0=136 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110976
BinaryOp                 add_24                   2 1 222 208 223 0=0
Split                    splitncnn_25             1 2 223 224 225
Convolution              conv_190                 1 1 225 226 0=816 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110976
Swish                    silu_97                  1 1 226 227
ConvolutionDepthWise     convdw_279               1 1 227 228 0=816 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=20400 7=816
Swish                    silu_98                  1 1 228 229
Split                    splitncnn_26             1 2 229 230 231
Pooling                  gap_15                   1 1 231 232 0=1 4=1
Convolution              conv_191                 1 1 232 233 0=34 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27744
Swish                    silu_99                  1 1 233 234
Convolution              convsigmoid_15           1 1 234 235 0=816 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27744 9=4
Reshape                  reshape_251              1 1 235 236 0=1 1=1 2=-1
BinaryOp                 mul_25                   2 1 236 230 237 0=2
Convolution              conv_193                 1 1 237 238 0=136 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110976
BinaryOp                 add_26                   2 1 238 224 239 0=0
Split                    splitncnn_27             1 2 239 240 241
Convolution              conv_194                 1 1 241 242 0=816 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110976
Swish                    silu_100                 1 1 242 243
ConvolutionDepthWise     convdw_280               1 1 243 244 0=816 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=20400 7=816
Swish                    silu_101                 1 1 244 245
Split                    splitncnn_28             1 2 245 246 247
Pooling                  gap_16                   1 1 247 248 0=1 4=1
Convolution              conv_195                 1 1 248 249 0=34 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27744
Swish                    silu_102                 1 1 249 250
Convolution              convsigmoid_16           1 1 250 251 0=816 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27744 9=4
Reshape                  reshape_252              1 1 251 252 0=1 1=1 2=-1
BinaryOp                 mul_27                   2 1 252 246 253 0=2
Convolution              conv_197                 1 1 253 254 0=136 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110976
BinaryOp                 add_28                   2 1 254 240 255 0=0
Split                    splitncnn_29             1 2 255 256 257
Convolution              conv_198                 1 1 257 258 0=816 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110976
Swish                    silu_103                 1 1 258 259
ConvolutionDepthWise     convdw_281               1 1 259 260 0=816 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=20400 7=816
Swish                    silu_104                 1 1 260 261
Split                    splitncnn_30             1 2 261 262 263
Pooling                  gap_17                   1 1 263 264 0=1 4=1
Convolution              conv_199                 1 1 264 265 0=34 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27744
Swish                    silu_105                 1 1 265 266
Convolution              convsigmoid_17           1 1 266 267 0=816 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27744 9=4
Reshape                  reshape_253              1 1 267 268 0=1 1=1 2=-1
BinaryOp                 mul_29                   2 1 268 262 269 0=2
Convolution              conv_201                 1 1 269 270 0=136 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110976
BinaryOp                 add_30                   2 1 270 256 271 0=0
Convolution              conv_202                 1 1 271 272 0=816 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110976
Swish                    silu_106                 1 1 272 273
ConvolutionDepthWise     convdw_282               1 1 273 274 0=816 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=20400 7=816
Swish                    silu_107                 1 1 274 275
Split                    splitncnn_31             1 2 275 276 277
Pooling                  gap_18                   1 1 277 278 0=1 4=1
Convolution              conv_203                 1 1 278 279 0=34 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27744
Swish                    silu_108                 1 1 279 280
Convolution              convsigmoid_18           1 1 280 281 0=816 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27744 9=4
Reshape                  reshape_254              1 1 281 282 0=1 1=1 2=-1
BinaryOp                 mul_31                   2 1 282 276 283 0=2
Convolution              conv_205                 1 1 283 284 0=232 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=189312
Split                    splitncnn_32             1 2 284 285 286
Convolution              conv_206                 1 1 286 287 0=1392 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=322944
Swish                    silu_109                 1 1 287 288
ConvolutionDepthWise     convdw_283               1 1 288 289 0=1392 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=34800 7=1392
Swish                    silu_110                 1 1 289 290
Split                    splitncnn_33             1 2 290 291 292
Pooling                  gap_19                   1 1 292 293 0=1 4=1
Convolution              conv_207                 1 1 293 294 0=58 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=80736
Swish                    silu_111                 1 1 294 295
Convolution              convsigmoid_19           1 1 295 296 0=1392 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=80736 9=4
Reshape                  reshape_255              1 1 296 297 0=1 1=1 2=-1
BinaryOp                 mul_32                   2 1 297 291 298 0=2
Convolution              conv_209                 1 1 298 299 0=232 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=322944
BinaryOp                 add_33                   2 1 299 285 300 0=0
Split                    splitncnn_34             1 2 300 301 302
Convolution              conv_210                 1 1 302 303 0=1392 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=322944
Swish                    silu_112                 1 1 303 304
ConvolutionDepthWise     convdw_284               1 1 304 305 0=1392 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=34800 7=1392
Swish                    silu_113                 1 1 305 306
Split                    splitncnn_35             1 2 306 307 308
Pooling                  gap_20                   1 1 308 309 0=1 4=1
Convolution              conv_211                 1 1 309 310 0=58 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=80736
Swish                    silu_114                 1 1 310 311
Convolution              convsigmoid_20           1 1 311 312 0=1392 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=80736 9=4
Reshape                  reshape_256              1 1 312 313 0=1 1=1 2=-1
BinaryOp                 mul_34                   2 1 313 307 314 0=2
Convolution              conv_213                 1 1 314 315 0=232 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=322944
BinaryOp                 add_35                   2 1 315 301 316 0=0
Split                    splitncnn_36             1 2 316 317 318
Convolution              conv_214                 1 1 318 319 0=1392 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=322944
Swish                    silu_115                 1 1 319 320
ConvolutionDepthWise     convdw_285               1 1 320 321 0=1392 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=34800 7=1392
Swish                    silu_116                 1 1 321 322
Split                    splitncnn_37             1 2 322 323 324
Pooling                  gap_21                   1 1 324 325 0=1 4=1
Convolution              conv_215                 1 1 325 326 0=58 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=80736
Swish                    silu_117                 1 1 326 327
Convolution              convsigmoid_21           1 1 327 328 0=1392 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=80736 9=4
Reshape                  reshape_257              1 1 328 329 0=1 1=1 2=-1
BinaryOp                 mul_36                   2 1 329 323 330 0=2
Convolution              conv_217                 1 1 330 331 0=232 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=322944
BinaryOp                 add_37                   2 1 331 317 332 0=0
Split                    splitncnn_38             1 2 332 333 334
Convolution              conv_218                 1 1 334 335 0=1392 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=322944
Swish                    silu_118                 1 1 335 336
ConvolutionDepthWise     convdw_286               1 1 336 337 0=1392 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=34800 7=1392
Swish                    silu_119                 1 1 337 338
Split                    splitncnn_39             1 2 338 339 340
Pooling                  gap_22                   1 1 340 341 0=1 4=1
Convolution              conv_219                 1 1 341 342 0=58 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=80736
Swish                    silu_120                 1 1 342 343
Convolution              convsigmoid_22           1 1 343 344 0=1392 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=80736 9=4
Reshape                  reshape_258              1 1 344 345 0=1 1=1 2=-1
BinaryOp                 mul_38                   2 1 345 339 346 0=2
Convolution              conv_221                 1 1 346 347 0=232 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=322944
BinaryOp                 add_39                   2 1 347 333 348 0=0
Split                    splitncnn_40             1 2 348 349 350
Convolution              conv_222                 1 1 350 351 0=1392 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=322944
Swish                    silu_121                 1 1 351 352
ConvolutionDepthWise     convdw_287               1 1 352 353 0=1392 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=34800 7=1392
Swish                    silu_122                 1 1 353 354
Split                    splitncnn_41             1 2 354 355 356
Pooling                  gap_23                   1 1 356 357 0=1 4=1
Convolution              conv_223                 1 1 357 358 0=58 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=80736
Swish                    silu_123                 1 1 358 359
Convolution              convsigmoid_23           1 1 359 360 0=1392 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=80736 9=4
Reshape                  reshape_259              1 1 360 361 0=1 1=1 2=-1
BinaryOp                 mul_40                   2 1 361 355 362 0=2
Convolution              conv_225                 1 1 362 363 0=232 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=322944
BinaryOp                 add_41                   2 1 363 349 364 0=0
Convolution              conv_226                 1 1 364 365 0=1392 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=322944
Swish                    silu_124                 1 1 365 366
ConvolutionDepthWise     convdw_288               1 1 366 367 0=1392 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=12528 7=1392
Swish                    silu_125                 1 1 367 368
Split                    splitncnn_42             1 2 368 369 370
Pooling                  gap_24                   1 1 370 371 0=1 4=1
Convolution              conv_227                 1 1 371 372 0=58 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=80736
Swish                    silu_126                 1 1 372 373
Convolution              convsigmoid_24           1 1 373 374 0=1392 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=80736 9=4
Reshape                  reshape_260              1 1 374 375 0=1 1=1 2=-1
BinaryOp                 mul_42                   2 1 375 369 376 0=2
Convolution              conv_229                 1 1 376 377 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=534528
Split                    splitncnn_43             1 2 377 378 379
Convolution              conv_230                 1 1 379 380 0=2304 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=884736
Swish                    silu_127                 1 1 380 381
ConvolutionDepthWise     convdw_289               1 1 381 382 0=2304 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 7=2304
Swish                    silu_128                 1 1 382 383
Split                    splitncnn_44             1 2 383 384 385
Pooling                  gap_25                   1 1 385 386 0=1 4=1
Convolution              conv_231                 1 1 386 387 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=221184
Swish                    silu_129                 1 1 387 388
Convolution              convsigmoid_25           1 1 388 389 0=2304 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=221184 9=4
Reshape                  reshape_261              1 1 389 390 0=1 1=1 2=-1
BinaryOp                 mul_43                   2 1 390 384 391 0=2
Convolution              conv_233                 1 1 391 392 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=884736
BinaryOp                 add_44                   2 1 392 378 393 0=0
Convolution              conv_234                 1 1 393 394 0=1536 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=589824
Swish                    silu_130                 1 1 394 395
Pooling                  gap_26                   1 1 395 396 0=1 4=1
Reshape                  reshape_262              1 1 396 397 0=1 1=1 2=-1
Flatten                  flatten_263              1 1 397 398
InnerProduct             linear_235               1 1 398 out0 0=404 1=1 2=620544
